export const content = {
  hero: {
    title: 'Что-то очень доброе и креативное',
  },
  
  invitation: {
    text: `Один день. Одно событие. Одна новая глава в нашей истории. Нам не нужны тысячи гостей, нам нужны вы — те, с кем хочется разделить этот трепет.
    Приглашаем вас не на свадьбу как на мероприятие, а в наш маленький мир — просто быть рядом в этот день, когда мы станем чуточку счастливее.`,
  },
  
  location: {
    title: 'Мы будем ждать вас по адресу: Москва, Большая Почтовая улица, 40, стр. 7, метро «Электрозаводская»',
    address: 'Лофт-пространство GOELRO зал "OM"',
    mapLink: 'https://yandex.ru/profile/-/CTUZ4J5B',
  },
  
  schedule: {
    title: 'Программа дня',
    items: [
      { time: '16:00', label: 'Сбор гостей' },
      { time: '16:30', label: 'Церемония' },
      { time: '17:00', label: 'Банкет' },
      { time: '23:00', label: 'Завершение' },
    ],
  },
  
  dressCode: {
    title: 'Дресс-код',
    description: 'Мы будем рады, если вы поддержите праздничную атмосферу и выберете нарядный, элегантный образ.',
    note: 'Для мужчин также подойдет светлый верх и темный низ.',
  },
  
  wishes: {
    title: 'Пожелания и подарки',
    description: 'Даже не знаю что можно нам подарить',
    note: 'Не хотим обременять вас выбором подарков, поэтому будем рады подарку в конверте :)',
  },
  
  rsvp: {
    title: 'Пожалуйста, подтвердите своё присутствие до какого-то августа 2026, чтобы мы могли планировать нашу свадьбу наилучшим образом.',
    formLabels: {
      name: 'Ваше Имя и Фамилия',
      nameSubtitle: 'Если Вы будете с парой или семьей, то заполните, пожалуйста, форму по очереди.',
      attendance: 'Вы сможете присуствовать на торжестве?',
      drinks: 'Что предпочитаете из напитков? (возможно выбрать несколько вариантов ответа)',
      stay: 'Планируете ли оставаться на ночь в домике на площадке?',
    },
    drinkOptions: ['Вино', 'Белое сух', 'Вино красное п/сл', 'Игристое', 'Водка', 'Коньяк', 'Безалко'],
    stayOptions: ['Да', 'Нет'],
    attendanceOptions: ['Да, конечно', 'К сожалению, не смогу'],
    buttonText: 'Отправить',
  },
  
  contacts: {
    title: 'Организаторы:',
    contacts: [
      { name: 'Валерия', handle: '@Lera_Agisheva', link: 'https://t.me/Lera_Agisheva' }
    ],
    note: 'по всем вопросам организации или по вопросам планирования подарка или поздравления.',
  },
}